sedfoam-master/test-ci/1DBedLoadTurb/constant/twophaseRASPropertiesSave
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      twophaseRASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// * * * * * definition of turbulence coefficient and others * * * * * * * * //

// Shared coefficients
SUS             SUS [ 0 0 0 0 0 0 0 ] 0.;
KE1             KE1 [ 0 0 0 0 0 0 0 ] 0;  //density stra (Uf-Us)
KE2             KE2 [ 0 0 0 0 0 0 0 ] 1;  //turb modulation
KE3             KE3 [ 0 0 0 0 0 0 0 ] 0;  //turb generation
KE4             KE4 [ 0 0 0 0 0 0 0 ] 1;  //density stratification g
B               B [ 0 0 0 0 0 0 0 ] 0.25; //turb modulation coeff
Cmu             Cmu [ 0 0 0 0 0 0 0 ] 0.09;

// Mixing length model coefficients
expoLM       expoLM [ 0 0 0 0 0 0 0 ] 1.0;
alphaMaxLM   alphaMaxLM [ 0 0 0 0 0 0 0 ] 0.61;
kappaLM      kappaLM [ 0 0 0 0 0 0 0 ] 0.41;

// k-epsilon model coefficients
C1             C1 [ 0 0 0 0 0 0 0 ] 1.44;
C2             C2 [ 0 0 0 0 0 0 0 ] 1.92;
C3ep           C3ep [ 0 0 0 0 0 0 0 ] 1.2;
C4ep           C4ep [ 0 0 0 0 0 0 0 ] 1;
alphak         alphak [ 0 0 0 0 0 0 0 ] 1.0;
alphaEps       alphaEps [ 0 0 0 0 0 0 0 ] 1.3;

// k-omega model coefficients
alphaOmega       alphaOmega [ 0 0 0 0 0 0 0 ] 0.52;
betaOmega        betaOmega [ 0 0 0 0 0 0 0 ] 0.072; // original k-omega: 0.072 // k-omega (2006): 0.0708
alphaKomega      alphaKomega [ 0 0 0 0 0 0 0 ] 0.5; // original k-omega: 0.5 // k-omega (2006): 0.6
alphaOmegaOmega  alphaOmegaOmega [ 0 0 0 0 0 0 0 ] 0.5;
Clim             Clim [ 0 0 0 0 0 0 0 ] 0.0; // original k-omega: 0.0 // k-omega (2006): 0.875
sigmad           sigmad [ 0 0 0 0 0 0 0 ] 0.0; // original k-omega: 0.0 // k-omega (2006): 0.125
C3om           C3ep [ 0 0 0 0 0 0 0 ] 0.35;
C4om           C4ep [ 0 0 0 0 0 0 0 ] 1;
omegaBC         omegaBC [ 0 0 -1 0 0 0 0] 0.e0;

// Limiters
Tpsmall         Tpsmall [1 -3 -1 0 0 0 0] 1e-6;
nutMax          nutMax [0 2 -1 0 0 0 0] 1e-1;

// ************************************************************************* //
